#!/usr/bin/env python3
arp_table = [('10.220.88.1', '0062.ec29.70fe'),
 ('10.220.88.20', 'c89c.1dea.0eb6'),
 ('10.220.88.21', '1c6a.7aaf.576c'),
 ('10.220.88.28', '5254.aba8.9aea'),
 ('10.220.88.29', '5254.abbe.5b7b'),
 ('10.220.88.30', '5254.ab71.e119'),
 ('10.220.88.32', '5254.abc7.26aa'),
 ('10.220.88.33', '5254.ab3a.8d26'),
 ('10.220.88.35', '5254.abfb.af12'),
 ('10.220.88.37', '0001.00ff.0001'),
 ('10.220.88.38', '0002.00ff.0001'),
 ('10.220.88.39', '6464.9be8.08c8'),
 ('10.220.88.40', '001c.c4bf.826a'),
 ('10.220.88.41', '001b.7873.5634')]
str2 = '' #буферная строка
for n in arp_table: #идём по кортежам из списка
	str1 = n[1].replace('.', ':').upper() #взяли мас, заменили . на : и сделали верхним регистром
	mass = str1.split(':') #разбили МАС в список по октетам через :
	for m in mass: #проходим по списку. в который разбили МАС
		buff1 = m[0:2] #срез первых 2х символов
		buff2 = m[2:4] #срез последних 2х символов
		str2 = str2 + buff1 + ':' + buff2 + ':' #собираем буффер конкатинацией строк
	print(str2.strip(':')) #сносим последний символ :
	str2 = '' #чистим буфер
